///*
//* LAB 7, Вариант №4
//* 4. Найти обратную матрицу для матрицы А. Входные данные: целое
//* положительное число n, произвольная матрица А размерности n х n. Решить
//* задачу двумя способами: 1) количество потоков является входным парамет-
//* ром, при этом размерность матриц может быть не кратна количеству пото-
//* ков; 2) количество потоков заранее неизвестно и не является параметром за-
//* дачи.
//*
//* Студентка - Ли Ицзя
//* гр. 5140904/30202
//*/
//#include <omp.h>
//#include <stdio.h>
//#include <vector>
//#include <iostream>
//#include <string>
//#include <fstream>
//
//
//int main() {
//	return 0;
//}
